{"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Delayed-Whiff-Punish-Option-Select":{"slug":"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Delayed-Whiff-Punish-Option-Select","filePath":"Street Fighter 6/General Training Drills/Advanced Drills/Delayed Whiff Punish Option Select.md","title":"Delayed Whiff Punish Option Select","links":[],"tags":[],"content":"TODO: clean this up\n\nSet Ryu to crouching, block 1, health standard (no refill).,\nAdd these block reversal options: cMP, cMK (8f here is an important minimum), Do Nothing.,\nInitiate with sLP (or your character’s main light poke).,\n\nThen hold d/b for 8f-12f minimum, then do your whiff-punish punish button. Ken would be cMK, Bison would be cMP, etc. into a combo you would normally use for whiff punish. If you do it right:\n\nWhen you are in-range of the button, you will block and no button will come out.,\nWhen you are out of range of the button, you will hit/whiff punish.,\nWhen they do nothing, you shouldn’t push a button.,\nAlternate looking for cMK and cMP. When you are looking for cMK, stand at tip range of sLP. When you are looking for cMP, stand within the cMK range when initiating with sLP, but outside cMP range (so that you’re also training the block of cMK if it comes out).,\n\nDo this for X health bars from 1P side and then X health bars from 2P side in the center of the screen. Reset if you have the wrong response during the health bar and start over."},"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Reversal-Defense-Option-Select":{"slug":"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Reversal-Defense-Option-Select","filePath":"Street Fighter 6/General Training Drills/Advanced Drills/Drive Reversal Defense Option Select.md","title":"Drive Reversal Defense Option Select","links":[],"tags":[],"content":"TODO: build this out\nDrive Reversal Defense Option Select. cr.LK &gt; SA1 during wake-up DR. If they block, SA1 doesn’t come out. aka Nephew tech aka what Micky did at EVO 2025. Make sure to have set the Drive Gauge to burn you out during your combo so the stimulus of being burnt out is there (and would encourage the other player to reverse.)\nUsefulness: low"},"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Rush-Defense-Option-Select":{"slug":"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Rush-Defense-Option-Select","filePath":"Street Fighter 6/General Training Drills/Advanced Drills/Drive Rush Defense Option Select.md","title":"Drive Rush Defense Option Select","links":[],"tags":[],"content":"TODO: clean this up\n\n\nPick your character with an invincible OD special (such as Ken with OD Shoryuken). Pick Cammy.,\n\n\nSet health to standard (not refill).,\n\n\nRecord Cammy (use midscreen position so that you can position the walk properly):\n\nSlot 1: walk c.MK xx Drive Rush s.LP &gt; throw: Respond with OD special, block, and then immediate throw tech (S3 change) or delayed throw tech (you can die to shimmy) ⇒ Note that Bison, Blanka, Cammy, Chun-Li, and Ryu can still shimmy you with c.MK xx Drive Rush c.LP or s.LP in S3 at standard ranges.,\nSlot 2: walk c.MK xx Drive Rush throw: Respond with OD special.,\nSlot 3: walk c.MK: Respond with nothing.,\n(optional, but provides DI option) Slot4: walk c.MK xx Drive Impact: Respond with Drive Impact counter.,\n(optional, Cammy does this a lot and getting used to inputting it before c.HP lands can be helpful) Slot 5: walk c.MK xx Drive Rush c.HP &gt; throw: Respond with OD special. You can replace Slot 2 with this too.,\n(optional) Slot 6: walk c.MK xx Drive Rush s.LP, s.LP, s.LK: Respond with OD special, block, and then do nothing.,\n\n,\n\n\nPlay all slots of actions and respond accordingly until the health bar goes to 0. The sequence after blocking a c.MK should be OD Reversal &gt; block &gt; throw tech. And no matter what decisions you make, it should be correct. The OD reversal won’t come out if Cammy does a true block string with Drive Rush c.LP or s.LP. Don’t always do this obviously in a real match because people can go invincible on you and certain S3 characters can still shimmy you. If you don’t respond correctly at any point, reset and start over in the middle of the screen. A good training set when starting out, do this 20 health-bars worth from left side and right side.,\n\n\nSide note: Bison, Blanka, Cammy, Chun-Li, Ryu still have OG drive rush where shimmy after s.LP can be done."},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Backwalking-and-Crouching-Uppercuts":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Backwalking-and-Crouching-Uppercuts","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Backwalking and Crouching Uppercuts.md","title":"Backwalking and Crouching Uppercuts","links":[],"tags":[],"content":"I think of these as two different drills, but they’ve been grouped here because the settings are exactly the same. This uppercut training is good for those who have gotten used to jumping on you when you’re walking backwards or crouching, including those who neutral jump to try to bait your throw whiff when the knockdown time is longer.\nMake sure to pick a character with a standard jump time (most of the cast) at 45F. I like using Sagat because his animation has specifically always felt heavy like I shouldn’t try to anti-air him even though the time is the same. Do not use characters that have slower jumps like Chun-Li. You can check for jumping frames on Fullmeter in the jumping tab.\nSettings\n\nVitality Recovery Settings (P1 and P2). Standard (no refill).\nBlock. Block All.\nDummy Behavior. Standing.\nWakeup Reversal Slots. Forward Jump.\nBlock Reversal Slots. Forward Jump.\nPosition. Middle of the screen.\n\nDrill\n\nExercise. Initiate with hitting the blocking opponent with a long-ranged attack like cMK. Then uppercut the opponent and repositioning relative to the enemy so that you’re backwalking or crouching again during the next jump when they wake up. You want to nail the anti-air as late and deep as possible because it’ll give you more okizeme time (to Drive Rush, dash, or walk forward afterward) in match. Reset if you’re wrong.\n\nIf it’s a backwalking uppercut, I often had to walk forward and to be able to walk backward during the next uppercut.\nIf it’s a crouching uppercut, I walked to the position where the jump would be caught and just crouched.\n\n\nSets/reps. 20 health bars from the left and then 20 health bars from the right in one set.\nExpanding. You can expand this drill by ending it with an OD Uppercut or Super when it will you think it will kill instead. Reset if you’re wrong. You can also expand this drill by adding a Do Nothing Slot or more Forward Jump slots with different Delay timings to make it harder. Reset if you’re wrong. I haven’t personally done this because I just jam quickly through this drill to fix my form.\n\nProper Form\n\nFor backwalking uppercuts, the input you want your hand to get used to going from b and then either f, d, df or df, d, df. This is based on your controller. Pad and leverless is easier with f, d, df. Stick can do either, but I do prefer the df, d, df.\nFor crouching uppercuts, the input you want your hand to get used to is going from either db then df, d, df because you want your character to crouch the entire time, making it harder for you to get hit by jumps.\nHolding df at the end of your input is a good way to feel completion of the motion and will help the input reader register the special move.\n"},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Charge-Character-Throw-Loops-+-Anti-Air":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Charge-Character-Throw-Loops-+-Anti-Air","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Charge Character Throw Loops + Anti-Air.md","title":"Charge Character Throw Loops + Anti-Air","links":[],"tags":[],"content":"With charge characters, throwing after a whiffed throw is very awkward. This drill is good for making charge reversals doable when a throw whiffs. The way to rewire this is to initiate throws with df+LP+LK or throw tech with db+LP+LK instead.\nTODO: Same exercise as Crosscut Uppercuts, but “throw loop” with df+LP+LK."},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Crosscut-Uppercuts":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Crosscut-Uppercuts","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Crosscut Uppercuts.md","title":"Crosscut Uppercuts","links":[],"tags":[],"content":"This uppercut training is good for keeping people in the corner, stopping people from crossing you up, and rewiring your brain to prioritize follow-up actions when throws get jumped. This training is specifically for uppercuts executed with the Dragon-punch/Shoryuken motion (f, d, d/f).\nMake sure to pick a character with a standard jump time (most of the cast) at 45F. Do not use characters that have slower jumps like Chun-Li. You can check for jumping frames on Fullmeter in the jumping tab.\nSettings\n\nVitality Recovery Settings (P1 and P2). Standard (no refill).\nBlock. Block All.\nDummy Behavior. Standing.\nWakeup Reversal Slots. Forward Jump, Vertical Jump.\nPosition. Corner of the screen, cornering opponent.\n\nDrill\n\nExercise. Initiate with throwing the opponent. Then go up for a throw loop throw (even if your character doesn’t have one either by walking, drive rushing, or dashing based on character). Then crosscut uppercut the forward jump or forward uppercut the neutral jump. You want to nail the anti-air as late and deep as possible because it’ll give you more okizeme time (to Drive Rush, dash, or walk forward afterward) in match. Reset if you miss even a single one.\n\nIf it’s a crosscut uppercut, allow the dummy to do whatever jump they will on wakeup, jump over them/dash under them and push them into the corner again. Reinitiate with a throw.\nIf it’s a forward uppercut, immediately whiff two throws after to get ready for the next jump rotation. You may need to manually wait here or frame kill if you want to get the timing perfect based on the character.\n\n\nSets/reps. 20 health bars from the left and then 20 health bars from the right in one set. It took me about 8-12 hours over multiple sets to get it right in SF6 to finally be able to see me using this in real battles.\nExpanding. You can expand this drill by ending it with an OD Uppercut or Super Art when it will you think it will kill instead. Reset if you’re wrong.\n\nProper Form\n\nCrosscut uppercuts in SF6 should be inputed in the following: f, df, d, db. Remember that the f input isn’t just for the Shoryuken (dp) motion, but to actually reposition a little bit so you’re a bit under. You want to be inputting d, db while they’re jumping over. Hold into the db at the end of the motion as if you were holding df at the end of a Shoryuken. The input window in SF6 for this is large, so getting used to inputting during a throw whiff gives a good amount of time and game feel.\nForward uppercuts should be done with f, d, df. You want to get used to starting with f (instead of df) for these. It seems like it would be the right way to go for optimization of crouching, but you’ll need the forward feel to quickly react to when you’re approaching from your offense and dealing with a jump. (This is a key difference from a charging character with a d,u charge reversal like Guile where you want to get used to throwing with df and holding df, so you don’t want to mess up your rewiring if you’re considering that).\nHolding df (or db for crosscut) at the end of your input is a good way to feel completion of the motion and will help the input reader register the special move.\n"},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Delayed-Drive-Rush-Offense":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Delayed-Drive-Rush-Offense","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Delayed Drive Rush Offense.md","title":"Delayed Drive Rush Offense","links":[],"tags":[],"content":"This drill is good for breaking your opponent’s guard in the following situations:\n\nYou read that they’re using throw-tech or jabs after blocking during a Drive Rush and want to pull them out.\nYou’ve created a sequence where they’ve blocked a lot of moves (usually 3+ blocked hits), so they now want to push a button to take back their turn. This happens often at the end of a match, near the depletion of the opponent’s Drive Gauge, and/or close to the corner.\nYou can feel that they’ve tightened up their guard and that you’re both hesitating and waiting in neutral, but you don’t want to risk Drive Rushing into a throw. This happens often at the end of a match.\n\nYou should not use this drill if the opponent is trained to always OD Reversal or Super Art when you Drive Rush a normal on them.\nSettings\n\nVitality Recovery Settings (P1 and P2). Standard (no refill).\nBlock. Block All.\nDummy Behavior.  Crouch.\nBlock Reversal Slots. Forward Throw (Delay: 5F), Forward Throw (Delay: 8F). (These delay windows create the fastest and slowest bound time you should attempt this.)\nPosition. Corner of the screen, cornering opponent.\n\nDrill\n\nExercise. Initiate with your long-ranged normal cancelled into a delayed Drive Rush normal to catch the throw tech. Example of this is Ken’s cMK xx (delayed) Drive Rush cMP. Then continue the combo on hit. Initiate again until they’re dead and adjust your follow-up combos accordingly. Reset if you’re wrong.\nSets/reps. 20 health bars from the left and then 20 health bars from the right in one set.\nExpanding. You can expand this drill by doing a corner carry for your first combo, a corner combo, a cash out combo to kill, etc. Reset if you’re wrong.\n\nProper Form\n\nWhen choosing the normal to cancel into a Drive Rush, I recommend choosing the most likely button you’re going to use the most like a character’s cMK at mid-range (or cMP if they don’t have a cancelable cMK).\nWhen choosing the normal to Drive Rush into, I recommend picking one that leaves you that allows you to continue the combo and to get a frame trap if they’re mashing jabs the entire time. A good example of this is Ken’s Drive Rush cMP that puts him +4F on block, allowing him to go into sMP/cMP for a follow-up combo on hit or frame trap a light/throw-tech on block.\n"},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Impact-Defense":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Impact-Defense","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Drive Impact Defense.md","title":"Drive Impact Defense","links":[],"tags":[],"content":"This training is good for encoding your system to react to Drive Impact by training your visual and audio cues as well as your reaction after getting the Drive Impact. If you add variable punishes based on the location on the screen or resource use, it can train situational punishes well too.\nSettings\n\nSimple Training Settings. Drive Impact Defense Practice. (We set this first so that we get Ryu with the recorded Drive Impact recordings.)\nVitality Recovery Settings (P1 and P2). Standard (no refill). (Change this after the above.)\nPosition. Middle of the screen.\n\nDrill\n\nExercise. Wait and respond to Drive Impact with your Drive Impact button. If you ever hit Drive Impact incorrectly as a non-reaction, reset.\nSets/reps. 20 health bars from the left and then 20 health bars from the right in one set.\nExpanding. You can expand this drill by doing a corner carry for your first combo, a corner combo, a cash out combo to kill, etc. Reset if you’re wrong.\n\nProper Form\n\nYou should always respond to Drive Impact with your Drive Impact button without shifting your hand. This gives you the fastest response time in real battle. For most people, this is going to be the “4P” button (often L1 on a stick or leverless controller) with your pinky. If you shift your hand to use your other fingers or you use two fingers to do HP+HK, restart.\n\nKen Expansion with Jinrai Loops\n\nOn first Drive Impact Counter in mid-screen: sMP, HP xx run, run Tatsumaki &gt; dash forward &gt; dash forward.\nOn second Drive Impact Counter in corner: cHP xx HK Jinrai xx (delayed) LK Followup &gt; LK Jinrai xx LK Followup &gt; HP Shoryuken.\nOn third Drive Impact Counter in corner: sHP xx Drive Rush sMP &gt; cHP xx HK Jinrai xx (delayed) LK Followup &gt; LK Jinrai xx LK Followup &gt; SA3.\n"},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Rush-Defense":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Rush-Defense","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Drive Rush Defense.md","title":"Drive Rush Defense","links":[],"tags":[],"content":"TODO: build this out, simple blocked recognition and forcing drive rush check\ncharacter recs: Juri, Ryu, etc."},"Street-Fighter-6/General-Training-Drills/Basic-Drills/OD-Reversal-Punish":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/OD-Reversal-Punish","filePath":"Street Fighter 6/General Training Drills/Basic Drills/OD Reversal Punish.md","title":"OD Reversal Punish","links":[],"tags":[],"content":"This training is good for encoding your system to react to OD Reversals that are blocked or whiffed with the proper punish. If you add variable punishes based on the location on the screen or resource use, it can train situational punishes well too.\nI recommend picking a character with a standard OD Reversal move such as Luke or Ryu so that you train punishing them on while they land.\nSettings\n\nVitality Recovery Settings (P1 and P2). Standard (no refill).\nBlock. Block All.\nDummy Behavior. Crouch.\nWakeup Reversal Slots. OD Reversal (Luke’s OD Rising Uppercut or Ryu’s OD Shoryuken). Set a Delay if the combo you’re using puts you too far from being able to punish it again.\nBlock Reversal Slots. OD Reversal (Luke’s OD Rising Uppercut or Ryu’s OD Shoryuken).\nPosition. Middle of the screen.\n\nDrill\n\nExercise. Initiate with a safe blocked normal like cMP. When you block the OD Reversal, do the punish combo you want to encode. Try to be close enough after your combo so that you can punish the next one and repeat this until their health bar is depleted. Reset if you’re wrong.\nSets/reps. 20 health bars from the left and then 20 health bars from the right in one set.\nExpanding. You can expand this drill by doing a corner carry for your first combo, a corner combo, a cash out combo to kill, etc. Reset if you’re wrong. You can also expand this drill by using different characters that propel forward—DeeJay and Juri can be difficult for some punishes to land given their forward momentum or animation landing.\n\nProper Form\n\nThe landing/recovery frames of certain OD Reversals may be tough to adjust to visually. Try different characters to get the timing correct.\n\nKen Expansion with Run Tatsumaki\n\nOn first OD Reversal, mid-screen: Run, run Tatsumaki &gt; sMP, HP xx run, run Tatsumaki &gt; dash forward &gt; dash forward.\nOn second OD Reversal, in corner: Run, run Tatsumaki &gt; sMP xx Drive Rush cHP xx run, run stop sMP xx Drive Rush cHP xx run, run stop sMP, HP xx run, run Shoryuken xx SA3.\n"},"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Ken-Jinrai-Recognition":{"slug":"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Ken-Jinrai-Recognition","filePath":"Street Fighter 6/General Training Drills/Character-Specific Defense Drills/Ken Jinrai Recognition.md","title":"Ken Jinrai Recognition","links":[],"tags":[],"content":"TODO"},"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/M.-Bison-Knee-Press-Recognition":{"slug":"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/M.-Bison-Knee-Press-Recognition","filePath":"Street Fighter 6/General Training Drills/Character-Specific Defense Drills/M. Bison Knee Press Recognition.md","title":"M. Bison Knee Press Recognition","links":[],"tags":[],"content":"Some M. Bison players are aggressive with Knee Press, often doing it when their positioning isn’t safe. You can encode this because the telegraphed sounds/animations of the Knee Presses are different and respond accordingly.\nSettings\n\nVitality Recovery Settings (P1 and P2). Standard (no refill).\nBlock. Block All.\nDummy Behavior.  Crouch.\nBlock Reversal Slots. Do Nothing, Light Knee Press, Medium Knee Press, Heavy Knee Press.\nPosition. Corner of the screen, cornering opponent.\n\nDrill\n\nExercise. Initiate with your medium to long-ranged normal like cMP. When it is blocked, Bison will react in these ways. Hold db and react accordingly.\n\nIf he does nothing, do nothing and reinitiate.\nIf he does HK Knee Press, do nothing and walk/dash/Drive Rush him back into the corner.\nIf he does LK/MK Knee Press, punish him with a 4f/5f combo accordingly.\n\n\nSets/reps. 5 health bars from the left and then 5 health bars from the right in one set.\nExpanding. You can expand this drill with a cash out combo at the end of the health bar to kill. Reset if you’re wrong.\n\nProper Form\n\nThe animation of the Light Knee Press is very fast, the “Nin” sound from the Medium Knee Press helps recognize it, and the Heavy Knee Press where you shouldn’t push has a different sound too.\n\nKen Expansion with Jinrai Loops\n\nOn LK/MK Knee Press before it will kill: sLK xx DR sMP &gt; cHP xx HK Jinrai xx (delayed) LK Followup &gt; LK Jinrai xx LK Followup &gt; HP Shoryuken.\nOn LK/MK Knee Press when it will kill: sLK xx DR sMP &gt; cHP xx HK Jinrai xx (delayed) LK Followup &gt; LK Jinrai xx LK Followup &gt; SA3.\n"},"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Ryu-Hashogeki-Fake-+-Fireball-Recognition":{"slug":"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Ryu-Hashogeki-Fake-+-Fireball-Recognition","filePath":"Street Fighter 6/General Training Drills/Character-Specific Defense Drills/Ryu Hashogeki Fake + Fireball Recognition.md","title":"Ryu Hashogeki Fake + Fireball Recognition","links":[],"tags":[],"content":"TODO"},"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Ryu-High-Blade-Kick-Recognition":{"slug":"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Ryu-High-Blade-Kick-Recognition","filePath":"Street Fighter 6/General Training Drills/Character-Specific Defense Drills/Ryu High Blade Kick Recognition.md","title":"Ryu High Blade Kick Recognition","links":[],"tags":[],"content":"TODO"},"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Sagat-Tiger-Nexus-Recognition":{"slug":"Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/Sagat-Tiger-Nexus-Recognition","filePath":"Street Fighter 6/General Training Drills/Character-Specific Defense Drills/Sagat Tiger Nexus Recognition.md","title":"Sagat Tiger Nexus Recognition","links":[],"tags":[],"content":"TODO"},"Street-Fighter-6/General-Training-Drills/Introduction,-Philosophy,-and-Methodology":{"slug":"Street-Fighter-6/General-Training-Drills/Introduction,-Philosophy,-and-Methodology","filePath":"Street Fighter 6/General Training Drills/Introduction, Philosophy, and Methodology.md","title":"Introduction, Philosophy, and Methodology","links":["Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Impact-Defense","Drive-Impact-Defense-+-Corner-Jinrai-Loops","Street-Fighter-6/Huy's-Ken-Journey/Ken-Training-Drills/Run-Tatsumaki->-sLP-xx-Run-Okizeme-Rotations-1-(Overhead)-and-2-(Low)","Street-Fighter-6/General-Training-Drills/Basic-Drills/Crosscut-Uppercuts","Street-Fighter-6/General-Training-Drills/Basic-Drills/Backwalking-and-Crouching-Uppercuts","Street-Fighter-6/Goal-Setting","Street-Fighter-6/General-Training-Drills/Advanced-Drills/Delayed-Whiff-Punish-Option-Select"],"tags":[],"content":"Training drills are great for the following reasons:\n\nWe can quickly repeat situations and learn it, encoding it to our play.\nIt’s a very low-stress and easy way to play, allowing you to have fun with the game without the need of an opponent or intense match.\nIt is common in every other craft or art that exists, so don’t neglect it!\n\nUse practice time accordingly.\nHow to Not Get Bored in Training Mode\nThe easiest way to get bored in training mode is by using it for only combos or having no goals.\nWays of making it more interesting:\n\nSet up the drill up properly so that it’s a mini-game with success/failure states. For example, setting the health bar to not refill, allowing the game to get to an end state is a core lever I use for designing a drill.\nHave an end goal of reps and sets (or a timer) so that you have a limited window of training. Then track the number of successful health bars depleted so you’ve gotten so that you feel progress (I use poker chips for this).\nSet goals of what you’re trying to learn explicitly before you train.\n\nGet comfortable with Training Mode and it can end up being fun.\nDesigning Offensive and Defensive Combination Drills\nOne way to make drills multifaceted is by combining a defensive drill with an offensive drill. This also gives you easier ways to create reps/sets.\nFor example, if you wanted to build out a drill to top-off Drive Impact Defense and also work on new combos, you might want to control it in this way:\n\nStart the standard Drive Impact Defense in the mid-screen.\nOn first Drive Impact counter, do a specific corner carry combo.\nOn cornered Drive Impact counter, do another specific corner combo.\nOn final Drive Impact counter, do a max-resource combo.\n\nThis keeps the defensive drill entertaining and doubles you up on training different skills.\nHow to Effectively Record SF6 Actions\nOn the Recording Settings tab, enable Recording Trigger to be “On Input” and set the Countdown to 5 seconds so that you can tighten up recordings and do them more easily!\nDetermine whether you need to recording the dummy approaching. If so, reset the positioning to mid-screen before you record it. If not, reset the positioning to corner/cornered before you record it. Remember that the reset controls for positioning are as follows:\n\nTouchpad = mid-screen\nUp+Touchpad = reversed-mid-screen\nRight+Touchpad = corner-right-screen\nUp+Right+Touchpad = reversed-corner-right-screen\nRight+Touchpad = corner-left-screen\nUp+Right+Touchpad = reversed-corner-left-screen\n\nHow to Save Training Options\nStreet Fighter 6 saves Reversal Settings and Recording Slots per character. If you spread out your training drills between multiple characters, you can swap to the drill you want without the need to set them up again with Character Select.\nHow Many Reps and Sets\nThe science of training is long and studied through many crafts and professions.\nPhilosophical data-points that I use:\n\nBruce Lee has been quoted saying, “I fear not the man who has practiced 10,000 kicks once, but I fear the man who has practiced one kick 10,000 times.” I’m not as lofty as him, but I understand that getting through my encoding phase of 1,000 good reps is just the beginning. Topping it off and using it in matches to eventually get to 10,000 times is the goal.\nOlympic Fencer and Medalist Ibtihaj Muhammad noted in her memoir that during high school, they would train 3 hours a day, 6 days a week. It’s incredible and humbling that even at the stakes of high school and with one season of training that the targets are like that. If I’m unwilling to train even a little bit, am I actually going to be able to answer the questions I have set out for myself?\nSteph Curry shoots 500 3-Pointers every single day. Whatever we may think, that’s greatness fueled by hard work in one of the most competitive sports in the world.\nMotor programs and Schmidt’s Schema Theory. Reaction time is created by phases of learning.\n\nIf we observe the above stories and theories, we can break down learning in the following steps:\n\nDrilling the skill to learn it with your hands. Until your hands are comfortable with the motion, you’re drilling the skill to get your hands right. Without this, you won’t be able to encode the skill to respond to situations appropriately. Before Master Rank, we oftentimes drill only to get to the end of this phase.\nEncoding the skill for use. Next, we need to automatically recognize the situations where the skill is useful so that we can apply it. This is an essential period for defensive drills. Familiarity with this phase will eventually lead to in-game use. In Master Rank, we should drill to get to the end of this phase because we’re trying to make all of our moves as extensions to ourselves. If we don’t, we’re better served by shortcutting a little with Modern (and even then, they have different encoding to do at higher ranks). Here, I’m trying to hit the goal of 1,000 good reps even though I often get to using the skill way before I’m done. Maybe I should tweak it down, I’m not sure. You should tune yourself to whatever you feel is a good encoding phase.\nTopping off the skill so off so it doesn’t get forgotten. How often should we repeat the drill regularly so that it remains in our toolbox? Some skills we’ll use so often in actual battle that we potentially may not need to do this anymore. Figuring out the need (or not) is the beauty of understanding and attuning to ourselves. Eventually, the goal is 10,000 good reps through topping it off and actual use.\n\nTo determine reps and sets, I use the following:\n\nI set the health bar to standard, no refill. How many reps depletes one health bar?\nHow many health bars can I deplete in 15m or 30m? This will determine the set. A very standard amount I use is a set of 20 health bars from 1P and 20 health bars from 2P in one set when primarily training combo damage. If I train a defensive drill that has a lot of negative states (such as Do Nothing), I may only do 5 health bars from 1P and 5 health bars from 2P in one set.\n\nThen on a weekly basis, I target getting the appropriate amount of sets in. And I track the total number of sets (given how many good reps are in each one) to figure out when a skill should get out of the encoding phase.\nExample: If I was doing combo training and it takes 3 combos to deplete a health bar, and I can deplete 20 health bars in 30 minutes from 1P and 2P sides, I would say that 1 set is equal to 3 combos x 20 health bars or 60 reps. If my encoding goal is 1,000 good reps, that means 1,000 good reps / 60 reps per set  or 17 sets (rounded from 16.67) that I want to accomplish with this drill before I potentially move it into top-off phase. During the encoding phase, I would try to get at least 1 set in per week.\nHow Many Drills Should We Juggle and How Much Should We Train\nI’m still trying to figure this out. At this point, I’m trying to get many drills to the top-off point so that my standard toolbox is larger.\nThe drills I’m juggling right now:\n\nFigure out two skills I’m encoding for use. This is where I’m trying to get to 1,000 reps over time. I’m trying to do 1-2 sets of these per week and adding it to the tracker. Currently in encoding:\n\nDrive Impact Defense + Corner Jinrai Loops. Bringing back Drive Impact Defense, but also training Corner Jinrai Loops for offense. This will eventually enter top off phase.\nRun Tatsumaki &gt; sLP xx Run Okizeme Rotations 1 (Overhead) and 2 (Low). Tighten up my okizeme rotations after sLP xx Run from Run Tatsumaki.\n\n\nTop off with defensive essentials. I am a player who feels more confident when I get my stops, so I prioritize them accordingly. I’m able to get enough time to do a set of these every week. Sometimes I get a second set. Currently in the rotation:\n\nCrosscut Uppercuts\nBackwalking and Crouching Uppercuts\n\n\nWarm up with one offensive set of combos and/or okizeme situation. This is generally what I’m doing in Training Mode either before playing or in-between Ranked Matches if I’m matching from Training Mode.\n\nI’m eagerly awaiting for those two skills I’m encoding to enter top-off stage. Then I can proceed with focusing on more advanced defensive drills or character specific drills (especially Ryu right now).\nIn terms of how much should we train, this is a personal ratio that all players figure out on their own. See Benchmarking from Other Players for examples!\nWhat About Combo Practice\nCombo practice is important in any fighting game. Where Street Fighter 6’s combo mastery lies is knowing the situation and optimizing whether we’re aiming to conserve resources, use resources, change screen positioning, etc. That’s how our play style and player expression is defined.\nThe essential combos:\n\nJab Confirm Combo. Whenever you get a jab, what is the meter-less follow-up?\nAll-Resource/Cash Out Combo. Whenever you can kill, do you know how to route to using all of your drive meter and Super Art 3 to finish someone off?\nDrive Impact Combo. Whenever you land a drive impact, do you know what combo to use before your opponent falls over?\nLong-Range Drive Rush Combo. When you’re battling in neutral and throwing out a medium or heavy button, do you have a combo that you can buffer Drive Rush behind and confirm?\nOki-Setup Combo. Do you have a combo where you trade damage to get another chance of keeping your turn and putting them into a mixup? To get a safejump?\nCorner-Carry Combo. If you need to push your opponent into the corner, do you have a combo that pushes them further than others?\n\nAdvanced combos incorporate more factors such as mid-combo resets (usually into a Drive Rush overhead or corner Drive Impact), corner escape, using super arts 1 and 2, drive damage, whether you can kill, safe jump setups, corner-only damage optimizations, and more. As you play your character longer and the above standard combos get ingrained, you should keep branching out as a player.\nAsking yourself what is optimal for yourself and valuing the eventual matrix of the different factors between your combos is a part of your own play style and player expression.\nWhat About Frame Traps, Space Traps, and Okizeme\nTraining mode can accomplish this easily by setting the On Block responses! Make sure to use this to come up with offensive sequences.\nRefer to these examples:\n\nDelayed Whiff Punish Option Select\nRun Tatsumaki &gt; sLP xx Run Okizeme Rotations 1 (Overhead) and 2 (Low)\n\nWhat Should I Train Next\nThe way that I’ve been approaching it is through the following framework in this order:\n\nWhat am I getting hit by?\nWhat am I repeatedly doing that doesn’t work?\nWhat am I forced to block that I could have stopped?\nDid I convert my hit optimally?\nAm I always low on resources most of the match? How can I use more meterless offensive sequences or combos?\nAm I still doing what my character should be good at? How can I enhance those? Are those strengths coming out against others?\nAm I covering what my character is weak at? How can I cover those? How can I avoid those situations.\nWhat buttons or special moves am I not using at all? Can I figure out a use for them?\n\nThis refinement of training strategy is what makes players different, so it’s up to us forge our own path."},"Street-Fighter-6/Goal-Setting":{"slug":"Street-Fighter-6/Goal-Setting","filePath":"Street Fighter 6/Goal Setting.md","title":"Goal Setting","links":[],"tags":[],"content":"What Will it Take\nThis is a hard question to answer because everyone will be different. I am not there yet, so I also cannot even say. This is my current working philosophy: figure out what questions I need to answer so I can sleep at night.\nThe questions I want to answer:\n\nWhere will I be if I put 400 hours (or 8,000 Battles) into Ranked Matches? What if I could find the time to play?\nWhat if I actually practiced? Can I attain an execution level that I would be proud of?\nEventually, can I do this with more characters more easily now that I’m at this new milestone?\n\nNone of these questions have value judgements. They also don’t have destinations that are unreachable. It’s just having the curiosity and putting in the work.\nHow Do I Track Progress\nI use the Tiny Experiments method outlined and written in Anne-Laure Le Cunff’s book of the same name.\nThe core Tiny Experiments method:\n\nChunk learning by making smaller pacts. If I look at the 400 hours of Ranked Matches I want to play, it will feel like an insurmountable amount. But if I chunk it down to 8 weeks of experimenting with whether I can keep up 140 Ranked Battles a week and then reevaluate, it becomes way more accomplishable.\nTrack my learning through Field Notes, Pluses, Minuses, and Next every week. This is a simple log that also allows me to reflect every week so that I’m actually appreciating the time I have and learning the lessons I should.\nLearn publicly. So others can help, hold me accountable, or comment if they want.\n\nI track this through a template with my own example on Google Drive. I then post this in the Discord group.\nBenchmarking from Other Players\nA caveat before looking at the numbers below: Take comfort in growth over time. If it didn’t take time and effort to grow, then that means that the ceiling has already been determined. We respect the amount of work that it takes and we all knew that it would be hard.\nThis is what hard looks like.\nIf we want to model ourselves based on the average curve of players, we can use the charts provided by CatCammy to figure out the ranges for goals.\nAverage Ranked Match Hours for MR in 2024:\n\n1500-1600 MR: 200h (or 4,000 battles) ranked.\n1600-1700 MR: 275h (or 5,500 battles) ranked.\n1700-1800 MR: 350h (or 7,000 battles) ranked.\n1800-1900 MR: 410h (or 8,200 battles) ranked.\n1900-2000 MR: 400h (or 8,000 battles) ranked.\n2000+ MR: 500h (or 10,000 battles) ranked.\n\nUntil we hit double those numbers (because of averages), it’s really hard to say that any of us have hit our ceiling.\nAnother way to approach figuring out where to put your efforts is to model after popular players who are out there now. Here are the following breakdowns for top buckets of time with legendary players on October 28, 2025 according to their Buckler profile.\n\n@GO13151 (Goichi/Go1). 487h Custom Room Matches, 434h Ranked Matches, 295h Practice. www.streetfighter.com/6/buckler/profile/1646033785\nBlaz 2G. 1293h Ranked Matches, 919h Practice, 386h Custom Room Matches. www.streetfighter.com/6/buckler/profile/3381453962\nBonchanRB. 1364h Practice, 1208h Custom Room Matches, 567h Ranked Matches. www.streetfighter.com/6/buckler/profile/2344551857\nCFN Good (Punk). 792h Ranked Matches, 704h Custom Room Matches, 163h Practice. www.streetfighter.com/6/buckler/profile/1224217951\nChrisWong. 1614h Ranked Matches, 864h Practice, 482h Custom Room Matches. www.streetfighter.com/6/buckler/profile/2606550179\nDaigoTheBeasTV. 1324h Practice, 1134h Ranked Matches, 552h Custom Room Matches. www.streetfighter.com/6/buckler/profile/3466035121\nHAITANI. 1275h Practice, 842h Ranked Matches, 765 Custom Room Matches. www.streetfighter.com/6/buckler/profile/3304337807\nhikaru_shiftne. 1396h Ranked Matches, 821h Practice, 739h Custom Room Matches. www.streetfighter.com/6/buckler/profile/3434437969\nHotDog29. 1473h Ranked Matches, 641h Practice, 624h Custom Room Matches. www.streetfighter.com/6/buckler/profile/2898412129\nitazan-pc (Itabashi). 1613h Practice, 1272 Ranked Matches, 1134 Custom Room Matches. www.streetfighter.com/6/buckler/profile/2706476162\nkawano. 1630h Ranked Matches, 1441h Practice, 844h Custom Room Matches. www.streetfighter.com/6/buckler/profile/1659765966\nLeShar. 831h Ranked Matches, 716h Practice, 563h Custom Room Matches. www.streetfighter.com/6/buckler/profile/1304761987\nll Moke ll (Moke). 1505h Practice, 995h Custom Room Matches, 943h Ranked Matches. www.streetfighter.com/6/buckler/profile/1764931801\nNemo1127. 1156h Practice, 532h Custom Room Matches, 517h Ranked Matches. www.streetfighter.com/6/buckler/profile/3427012082\nKazunoko. 1496h Ranked Matches, 789h Custom Room Matches, 516h Practice. www.streetfighter.com/6/buckler/profile/2626960876\nkobayan. 1189h Ranked Matches, 464h Custom Room Matches, 411h Practice. www.streetfighter.com/6/buckler/profile/1213256182\nMomochi. 1841h Practice, 1008h Custom Room Matches, 111h Ranked Matches. www.streetfighter.com/6/buckler/profile/2306256404\nnaruo. 1905h Ranked Matches, 788h Practice, 492h Custom Room Matches. www.streetfighter.com/6/buckler/profile/2650298964\nNLNL. 2507h Ranked Matches, 1645h Practice, 398h Custom Room Matches. www.streetfighter.com/6/buckler/profile/4029657578\nSAKONOKO_GAME. 2297h Battle Hub, 2029h Practice, 358h Custom Room Matches. www.streetfighter.com/6/buckler/profile/3629694153\nSBI_Hibiki. 814h Ranked Matches, 498h Practice, 497 Custom Room Matches. www.streetfighter.com/6/buckler/profile/3108342606\nShuto. 619h Practice, 545h Ranked Matches, 406h Custom Room Matches. www.streetfighter.com/6/buckler/profile/1735713734\nTokido. 1275h Custom Room Matches, 908h Practice, 901h Ranked Matches. www.streetfighter.com/6/buckler/profile/3826541678\nTorimeshi. 874h Ranked Matches, 575 Custom Room Matches, 557h Practice. www.streetfighter.com/6/buckler/profile/1396895782\nTsuneHERO (Gachikun). 3011h Practice, 2752h Custom Room Matches, 342 Offline Matches. www.streetfighter.com/6/buckler/profile/1947638102\n.YAS.. 931h Practice, 870h Battle Hub, 435h Ranked Matches. www.streetfighter.com/6/buckler/profile/3857418744\n"},"Street-Fighter-6/Huy's-Ken-Journey/Introduction,-Goals,-and-Training":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Introduction,-Goals,-and-Training","filePath":"Street Fighter 6/Huy's Ken Journey/Introduction, Goals, and Training.md","title":"Introduction, Goals, and Training","links":["Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Impact-Defense","Street-Fighter-6/General-Training-Drills/Basic-Drills/OD-Reversal-Punish","Street-Fighter-6/General-Training-Drills/Basic-Drills/Delayed-Drive-Rush-Offense","Street-Fighter-6/General-Training-Drills/Basic-Drills/Crosscut-Uppercuts","Street-Fighter-6/General-Training-Drills/Basic-Drills/Backwalking-and-Crouching-Uppercuts","Street-Fighter-6/Huy's-Ken-Journey/Ken-Training-Drills/Run-Tatsumaki->-sLP-xx-Run-Okizeme-Rotations-1-(Overhead)-and-2-(Low)","Street-Fighter-6/General-Training-Drills/Character-Specific-Defense-Drills/M.-Bison-Knee-Press-Recognition"],"tags":[],"content":"These are actual notes that I’ve collected and worked in my brain when playing Ken. No more, no less. These are here as a record of what it took me to play this character.\nThere are a few core things to note about my journey that is relevant:\n\nI have the honor of being in the company of great players who helped me grow every Thursday. Without putting in those hours with them and having a shared love for this game, I wouldn’t have tried this. I’ve learned how to play nuanced Street Fighter 6 from playing with them on so many Thursdays.\nI’m over-indexed on BattleHub and Custom Room, so the next part of my journey is fixing Ranked Matches and using Training Mode explicitly. The beginning of my Tiny Experiments tracking is the beginning of playing Ken at Master Rank.\nFinding the time to play is difficult. I typically only play games for 3 hours a week, which was Thursday. I am trying to carve out an additional 7 hours (or 2 nights) a week to pursue these goals.\n\nHigh-Level Goal Tracking\nGoals:\n\nPut 1,000 / 2,000 / 3,000 / 4,000 / 5,000 / 6,000 / 7,000 / 8,000 / 9,000 / 10,000 Ranked Battles (50 hour increments each) into Ranked Battles! Buy 1 Outfit at each milestone.\nHit 1,600MR (High), 1,650MR, 1,700MR (Grand), 1,750MR, 1,800MR (Ultimate). Buy 2 Outfits, C1 Color Bundle, 1 Challenger Avatar at each milestone.\n\nOutstanding Purchases: 1 Outfit, 1 Color Bundle.\nNotes:\n\n1,000 Ranked Battles = 50 hours.\nFor Buy C1 Color Bundle, alternatively buy 8 colors.\n\nTraining\nInitial Combos\nThese are the combos I actually use a majority of the time learning Ken. There are more specialized combos for specific situations or maxing out more damage, but starting here has been a good place for me.\nThe core combos:\n\nJab Confirm Combo. cLP/cLK xx cLP/cLK xx sLP xx HP Shoryuken.\nMeterless Combos from Pokes.\n\ncMP/cMK/sHP xx MK Jinrai xx LK Followup.\ncMP/cMK/sHP xx run, run Shoryuken.\n\n\nDrive Rush Combo.\n\nCorner Carry and Oki. `cMP/cMK/sHP xx DR cHP xx run, stop &gt; sMP,HP xx run, run Tatsumaki.\nDamage. cMP/cMK/sHP xx DR cHP xx run, stop &gt; sMP,HP xx run, run Shoryuken.\nSafejump. cMP/cMK/sHP xx DR cHP xx run, stop &gt; sMP,HP xx MK Jinrai &gt; Jump Forward.\n\n\nCash Out Looping SA3 Combo.  cMP/cMK/sHP xx DR cHP xx run, stop &gt; sMP xx DR cHP xx run, stop &gt; sMP,HP xx run, run Shoryuken xx SA3.\nLong-range Whiff-Punish Combo.  PC sHK &gt; DR sHP xx run, run Shoryuken. You may need the meterless version when burnt out or conserving meter with PC sHK &gt; run, run Shoryuken, so that’s worth practicing.\nBlocked/Whiffed OD Reversal Punish Counter. Run, run Tatsumaki &gt; sMP,HP xx run, run Shoryuken. More damage variants by routing differently after sMP, but those will be obvious as you play more Ken.\nDrive Impact Midscreen SA2 Cash Out Combo. DI &gt; cHP xx HK Jinrai &gt; OD Dragon Lash &gt; OD Jinrai xx HK,HK Followups xx SA2.\n\nTraining Drill List\nOutside of combos, this is the order of training drills that have helped me realize Ken.\nIn order:\n\nDrive Impact Defense\nKen Expansion with Run Tatsumaki\nDelayed Drive Rush Offense\nCrosscut Uppercuts\nBackwalking and Crouching Uppercuts (as two separate drills)\nRun Tatsumaki &gt; sLP xx Run Okizeme Rotations 1 (Overhead) and 2 (Low)\nKen Expansion with Jinrai Loops\nKen Expansion with Jinrai Loops\n\nResources\n\nBCTP Club: www.streetfighter.com/6/buckler/club/c7f6693937174889960be38433e0e073\nCoffeeHuy Buckler Profile: www.streetfighter.com/6/buckler/profile/2598585360\n"},"Street-Fighter-6/Huy's-Ken-Journey/Ken-Drive-Damage-Routes":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Ken-Drive-Damage-Routes","filePath":"Street Fighter 6/Huy's Ken Journey/Ken Drive Damage Routes.md","title":"Ken Drive Damage Routes","links":[],"tags":[],"content":"Drive Damage Tests\n\n(fully blocked) (DR cMP/DR sHP) xx DR sHP xx MK Jinrai xx LK Follow-up. True block-string other than the LK follow-up, use 3 bars of drive for 1.5 bars of drive damage. If you can get sHP by itself without cancel or sHP xx HK Jinrai before starting this, the drive damage will be immense.\nIn combo-routing, the only things that allow you to to go into a guaranteed Drive Impact on hit with Ken are heavy punches. So sHP/cHP xx DI will cost 1 drive bar to do 1 drive bar of damage. If you’re ahead on drive or they only have 1 drive bar left, this is something to be extremely aware of so that you don’t have to use Super Art meter. Remember that SA1 is 0.5 drive bars of damage, SA2 is 1 drive bar of damage, and SA3 is 1.5 drive bars of damage on it.\n\nSA2 on -5 on Block or -1 on Burnout\n\nYou can attack drive bar with a lot of resources: DR sHP &gt; sMP, HP xx DR sHP &gt; sMP, HP xx OD Jinrai &gt; HK,HK Followup xx SA2 for 3.8 drive bars of drive damage costing 5.1 drive bars. If they push a button during sMP, HP xx DR sHP, you will trade and you can score a hit of sHP xx run, run Shoryuken (or others).\nDR sHP &gt; sMP, HP xx OD Jinrai xx HK,HK Followup xx SA2 costs 2.8 drive bars to do 2.9 drive bars of drive damage.\nMax chip damage in the corner when they’re burnt out: sMP xx OD Hadoken &gt; sMP xx OD Hadoken &gt; sLK xx OD Jinrai xx HK,HK Followup xx SA2 &gt; OD Shoryuken.\n"},"Street-Fighter-6/Huy's-Ken-Journey/Ken-Okizeme-Notes":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Ken-Okizeme-Notes","filePath":"Street Fighter 6/Huy's Ken Journey/Ken Okizeme Notes.md","title":"Ken Okizeme Notes","links":[],"tags":[],"content":"Okizeme Situations\n25f Advantage\n\nsMP, HP xx run, run Shoryuken = 25f oki\nHP Shoryuken = 25f oki\nOkizeme\n(whiff) c.LP &gt; (usually blocked) s.HP &gt; s.LP (invest more with xx Drive Rush s.LP)\n\n26f Advantage\n\nsMP, HP xx MK Jinrai &gt; HP Shoryuken = 26f oki\nsMP, HP xx MK Jinrai, delayed HK follow-up &gt; HP Shoryuken = 26f-27f\nOkizeme\n(see 25f routing)\n\n28f Advantage\n\nJinrai LK and MK &gt; CH follow-up LK = 28f oki\nTODO: Okizeme\nTODO: (whiff) s.MP &gt; c.MP xx MK Jinrai, LK follow-up?\nforward dash &gt; st.HP\nrun &gt; run overhead kick\nforward dash &gt; forward throw (might need microwalk if they backroll)\nforward dash &gt; microwalk back to avoid the throw for possible shimmy setup\n(corner) (whiff) st.LP &gt; OD Hadoken is +2 on block, +6 on regular hit. It will also beat level 1 supers on OD Hadoken, so you can keep continuing with cr.HP when you Punish Counter them.\n(corner) (whiff) cr.LK &gt; st.HP is 0 on block, +5 on regular hit\n\n32f Advantage\n\nsMK, MK, HK\nTODO: Okizeme\n\n33f/34f Advantage\nShould I discard this route? I’m used to using it, but it does do less damage than the HP Shoryuken variants in the corner. It’s good for creating baits though, so when you land, you can bait a whiffed s.MP and then walk back with more frames.\n\nc.MP xx LK Tatsumaki &gt; MP Shoryuken = 33f\nsMP, HP xx MK Jinrai, delayed HK follow-up &gt; MP Shoryuken = 33f-34f\nsMP, HP xx MK Jinrai &gt; MP Shoryuken = 34f\nTODO: Okizeme\n\n36f Advantage\n\nSuper Art 2 = 36f oki\nOkizeme\n(corner) (whiff) s.LP &gt; LP Hadouken? TODO: Test\n\n40f Advantage\n\nc.HK\nOkizeme\nTODO\n\n42f Advantage\nThis is the corner safe jump route.\n\nsMP, HP xx MK Jinrai = 42f oki.\ns.MP, HP xx run, run Dragonlash = 42f oki.\nOkizeme\n(corner) safe j.HP for major advantage on block, TODO: test shimmy ability\n(corner) safe j.MK for minor advantage on block, but easier throw timing. TODO: test shimmy ability\n(corner) safe empty jump for low/throw mixup\n(corner) (whiff) s.MK &gt; s.HP\nTODO: (corner) safe j.LK? , TODO: test shimmy ability\nTODO: (corner) safe j.HK, TODO: test shimmy ability\ntwo dashes &gt; throw\ntwo dashes &gt; c.LP\n\n43f Advantage\n\ns.MP, HP xx run, run Tatsumaki = 43f oki\nOkizeme\n(corner) Whiffed empty jump, you won’t get a normal with it on block. So it’s best to go for throw, s.LP, or c.LK.\n(whiff) s.LP xx run, run overhead &gt; c.LP &gt; s.MP, HP xx MK Jinrai, HK followup &gt; HP Shoryuken\n(whiff) s.LP xx run, run stop &gt; c.LK, s.LP, s.LP xx HP Shoryuken\n(whiff) s.LP xx run, run stop &gt; throw\n\nTODO: c.HP xx HK Hurricane Kick\nTODO: c.MK xx MK Hurricane Kick\nOkizeme Building Blocks\nThese moves should help construct new okizeme situations. Remember that if you can get the block situation such that it’s +f because you’re on the last active frame, that’s a winner. Otherwise, you want to be able to mix between multiple options.\nMoves\n\nDash forward. 19f total.\nDash backward. 22f total.\nThrow: i5f/30f total.\nrun, run stop. 16f total.\nrun, run overhead. i18f/40f total/-3f on block.\nrun, run step kick. i10f/33f total/-4 on block.\ncLP = i4f/14f\ntotal/-1f on block.\nsLP = i4f/13f total/-1f on block.\ncMP. i6f/24f total/0f on block.\nsMP. i5f/22f total/-2f on block.\ncHP = i8f/35f total/-10f on block.\nsHP = i10f/31f total/-2f on block.\ncLK = i5f/18f total/-3f on block.\nsLK = i5f/18f total/-2f on block.\ncMK = i7f /28f total/-6f on block.\nsMK = i8f/30f total/-5f on block.\ncHK = i8f/35f total/-10f on block.\nsHK = i12f/38f total/-5f on block.\n"},"Street-Fighter-6/Huy's-Ken-Journey/Ken-Player-Checks":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Ken-Player-Checks","filePath":"Street Fighter 6/Huy's Ken Journey/Ken Player Checks.md","title":"Ken Player Checks","links":[],"tags":[],"content":"These are in-game checks to perform as a Ken player that isn’t character-specific. Always keep them in mind if you need to gather more data to figure out a weakness to exploit.\nKen-Specific Checks\n\nTODO: cMK xx Drive Rush sLP &gt; throw vs. sMP\nTODO: oki drive rush cLK (walking away, throw tech, or cLP) vs drive rush cMP/sHP\nTODO: sLK &gt; sHK will they eat space traps?\nTODO: Jinrai: do they jab under pressure?\nTODO: Range 2.5 LP Hadoken: will they jump improperly?\nTODO: will they reverse/PP/etc. the Jinrai follow-up?\nTODO: will they check drive rushes at neutral?\nTODO: jump a long-ranged fireball &gt; run SRK\n\nGeneral Checks\n\nTODO: will they react to DI?\nTODO: Are they parrying too much?\nTODO: are they walking back too much?\nTODO: are they shimmying too much?\nTODO: jump fireballs\nTODO: are they jabbing after everything?\n"},"Street-Fighter-6/Huy's-Ken-Journey/Ken-Training-Drills/Run-Tatsumaki->-sLP-xx-Run-Okizeme-Rotations-1-(Overhead)-and-2-(Low)":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Ken-Training-Drills/Run-Tatsumaki->-sLP-xx-Run-Okizeme-Rotations-1-(Overhead)-and-2-(Low)","filePath":"Street Fighter 6/Huy's Ken Journey/Ken Training Drills/Run Tatsumaki > sLP xx Run Okizeme Rotations 1 (Overhead) and 2 (Low).md","title":"Run Tatsumaki > sLP xx Run Okizeme Rotations 1 (Overhead) and 2 (Low)","links":[],"tags":[],"content":"TODO"},"Street-Fighter-6/Ranked-Matches/Introduction-and-Fundamentals":{"slug":"Street-Fighter-6/Ranked-Matches/Introduction-and-Fundamentals","filePath":"Street Fighter 6/Ranked Matches/Introduction and Fundamentals.md","title":"Introduction and Fundamentals","links":["Street-Fighter-6/Ranked-Matches/Matchups","Street-Fighter-6/Huy's-Ken-Journey/Ken-Player-Checks","Street-Fighter-6/Goal-Setting","Street-Fighter-6/General-Training-Drills/Basic-Drills/Delayed-Drive-Rush-Offense","Street-Fighter-6/General-Training-Drills/Advanced-Drills/Delayed-Whiff-Punish-Option-Select"],"tags":[],"content":"Having a Game Plan for Matchups\nThere is a clear difference between a player that heads into a matchup thinking about what plan they’re going to execute and one that doesn’t have one at all.\nThese are the things I’m working with:\n\nRecount anti-character matchup notes in my head when I see the character appear on the challenger screen. See Matchups.\nHave a set of questions that I want to answer for my own character (or in general) before I start. Specific ones to such as what the enemy will wakeup with after Ken’s corner carry to what will an opponent do when I execute a Jinrai on block. General ones such as will they let me jump in on them. Will they throw tech proactively? See Ken Player Checks.\nHave a set of questions that I want to answer from my opponent’s character. Are they this type of player who does this with their character? What will they abuse? What will they put on the table.\n\nWith this simple framework, there’s an intention to approach every match with a plan, but still be nimble.\nManaging Momentum and Energy\nSee Goal Setting.\nReducing Rank Importance of Opponents and Managing Long Sessions\nWe intrinsically know that points don’t matter. Whether they’re League Points (LP) or Master Rate (MR), it’s just a number that goes up and down. However, we’ve all been trained by society to do well in school and compete. That’s healthy in ways and unhealthy in others.\nIf we look at the best players in Benchmarking from other players, we understand that it takes many battles and hours to get there. And realistically, we wouldn’t have it any other way because if it was any other way, the ceiling would be capped solely by “innate talent” versus dedication and hard work. So the answer to getting better is to play, even if playing isn’t easy.\nFor me, the tactics that have actually worked making playing ranked easier:\n\nUse Street Fighter 6’s HUD to hide displaying ranks. Underestimating or overestimating your opponents is one of the deadliest things that can affect your play. When you play in-person, there is no magical rank that floats over their heads, so just remove it. Everyone you play deserves the same level of respect.\nRemember that your own rank and number is only where it’s at if you stop playing. There is no such thing as actual failure. And its’ value is only what you give it, so celebrate the victories and forgive yourself when you’re down. Growth takes adversity and this is what hard looks like. If it wasn’t hard, it wouldn’t be worth the effort.\nCount the number of battles you’ve played in the current session rather than wins/losses. Set goals to hit a battle count rather than to keep playing until you’re up (or recovering from being down) on points. I keep a stack of poker chips that I move from one stack to the next, converting 1s to 5s and 25s. The act of just counting and seeing a number go up rewires the monkey brain from caring too much about the in-game numbers. It’s healthy to set a goal before the session so that you know when you’re stopping. If you hit your goal, you can decide to go for another limited amount of battles or just switch to practice/training.\n\nNeutral Skips\nAll fighting games are built around some sort of neutral skipping, character-specific movement, and ranges. That is a fact of character differences to core game mechanics. How you deal with them defines your play style and expression in the game.\nAt the beginning, learning how to neutral skip will get many victories. Similarly, using all of our resources will secure us many victories. But as we get better, we learn nuance to when we should use resources and when we should use neutral skips.\nIn the Master Rate grind, we’ll feel these even more:\n\nBurning out early is deadly and can lead to immediate checkmating.\nDrive Rush is a lot less powerful than before, with many able to check you.\nAny “stops” (such as a Drive Rush Check, Anti-Air, or OD Reversal) sends a dramatic message.\n\nThis means that the value of meter-less combos, character positioning, and anti-airs become even more important.\nThe goal then is to solidify using them and introducing more variation and taking less risks. For example, simply moving quickly left/right with your character repeatedly can trigger people awaiting dashes and Drive Rushes, giving you an opportunity to mask your movement. So use the understanding of the Green, Yellow, and Red Zones and human reactions appropriately.\nVisualization and Categorizing Opponent + Tuning Through Jargon\nOne of the things we all do as players is to categorize opponents when we face them in a set. We all do this subconsciously. However, if we do this consciously, it opens up solutions that we wouldn’t normally take, allowing us to exceed the expectations of the opponent and ourselves.\nI recategorize players every new set with the following jargon:\n\nWhen playing the footsies triangle: protect, sway, approach.\n\nProtect. Checking with a move to stop someone from walking forward, usually at max confident range.\nSway. Walking backward to create space for a whiffed move and then punishing it. Note that the #1 reason many players who walk backward lose is that they don’t look for a whiff and get cornered for giving away the space for free. That’s why the word here is “sway.”\nApproach. Walking forward to close space and potentially make a move.\n\n\nWhen playing defense: block, parry, reverse.\n\nBlock. Lowest risk play when on defense, waiting for the turn to be over.\nParry. Medium risk play, trying win defense or conserve drive without major risk other than throw (or Drive Impact when recovering).\nReverse. High risk play, not letting the opponent take a real turn (or a turn with gaps).\n\n\nWhen playing timing: immediate, slightly/counter-hitting (aka. counter: slightly delayed, looking for interrupt), heavy/whiff-punishing (aka: reposte: heavily delayed, looking for whiff).\n\nImmediate. Keeping your offense tight with low-risk, but obvious timing.\nSlight/Counter-Hitting. Taking slight risk to introduce variance for people who just Block.\n\nA drill useful for training delayed buttons is using the Delayed Drive Rush Offense because you’re in an advantaged situation.\n\n\nHeavy/Whiff-Punishing. Taking higher risk with loose footsies at neutral for enemies who are very active, but the least obvious timing.\n\nA drill useful for training whiff punishing at the expert level is Delayed Whiff Punish Option Select because you’re able to fish out medium normals and spacing.\n\n\n\n\n\nIf we look at the above as sliders, the over-conservative style of play is protect footsies, block defense, and immediate timing. The most aggressive style of play is approach, reverse on block, and heavy/whiff-punishing.\nThe way we get into Master Rank is usually prioritizing the following sliders: sway, block, and immediate. But the way we Master Grind is to become loose with all of the sliders and not always use this inclination. Where we prioritize is our play style and determines whether we enhance our character’s strengths or cover our character’s weaknesses in every given moment."},"Street-Fighter-6/Ranked-Matches/Matchups":{"slug":"Street-Fighter-6/Ranked-Matches/Matchups","filePath":"Street Fighter 6/Ranked Matches/Matchups.md","title":"Matchups","links":[],"tags":[],"content":"AKI\n\nTODO: AKI has no OD reversal\nTODO\n\nAkuma\n\nTODO\n\nBlanka\n\nTODO: air ball\nTODO: DP pockets, use LP DP, especially on second ball of SA2\nTODO: It’s very difficult to PP Blanka Ball or DP it, it isn’t Headbutt, proceed with caution. If you do try to PP a Blanka Ball, it’s worth holding onto parry and drive rushing after to see if you can get anything\nTODO: If you can shoot, shooting once or twice can get the Blanka thinking about  sliding. Keep putting in thoughts of what you might do to force unwanted moves.\nTODO\n\nCammy\n\nAt Range 2.5+, if Cammy is going to travel across the screen, it’s going to be Spin Knuckle or Hooligan Combination. Both can be beaten by jabs, conversion is different though.\nCammy players are good at figuring out when to Cannon Strike, usually when you’re walking back. TODO backwalking uppercuts\nTODO\n\nChun-Li\n\nChun’s jump time from normal jumps and how the screen shifts vertically when she goes up provides a good tell for anti-airs. If she crosses you up with her df+HK (Falling Crane), crosscut it.\nChun’s light fireball goes about 2 character ranges away before it disappates. A good way to fight her is to backdash/walk back into the disappate range and then prepare to check her if she walks in thinking she still has the shield to block you.\nTODO\n\nC. Viper\n\nTODO\n\nDee Jay\n\nTODO: overhead tests\nTODO: drive rush checks with OD, especially when low on meter\nTODO: long-ranged DI\nTODO: is DeeJay crouching for fireball or standing?\nTODO\n\nDhalsim\n\nTODO: Ground and air teleport\nTODO\n\nE. Honda\n\nTODO: Understanding charge timing\nTODO: Will he do OD Headbutt after Headbutt\nTODO: Round opener buttslam\nTODO: OD reversal?\nTODO\n\nEd\n\nTODO: Ed’s range and checking (see Jamie notes). High confidence.\nTODO: whiffed uppercuts\nTODO: safe jumps\nTODO: DIs\nTODO: backing away and making him come to you\nTODO\n\nElena\n\nTODO: You can’t whiff heavy attacks against Elena and likely not even medium attacks in neutral\nTODO\n\nGuile\n\nTODO: overhead tests\nTODO: Sonic blade low vulnerability\nTODO: Is Guile crouching for Sonic Booms or standing?\nTODO: PP\nTODO\n\nJamie\n\nJamie’s space traps are built in, don’t push buttons after most moves—it’s a setup. Because of Jamie’s confidence in space traps and pushing buttons, checks can come easily too. Do not drive rush to try to cheat neutral.\nJamie can setup a safe-jump when cornering you off of most conversions. Fuzzy block into throw\nTODO\n\nJP\n\nTODO: whiffed cHP\nTODO: Fighting under departures\nTODO: double-jumping actually works\nTODO: ideal range is outside of cane pokes and ambiguous AA jump range\nTODO\n\nJuri\n\nTODO: Slowing down Juri’s dashes midscreen.\nTODO: Midscreen DR throw loop. Corner throw loop.\nTODO\n\nKen\n\nTODO: Ken has no +on block normals outside of drive rush.\nTODO: HK Dragonlash\nTODO\n\nKimberly\n\nTODO: An opener a lot of Kimberlys like to take is jumping into a whiffed elbow to bait a DP reaction and then go for the punish. If you’re ready for this, you can drive rush up into your own push or even anti-air.\nTODO: always be ready to DI on a corner reset\nTODO\n\nLily\n\nLily needs stock and her ability to check you might be\nLily will test whether you DI after blocking a cHP. You can tell if she does whether she does cHP xx Wind Stock automatically or if she does cHP with no follow-up. If you’re going to try TODO\nTODO\n\nLuke\n\nLukes like to cMP/cMK drive rush into pressure, so Drive Rush Defense Option Select Or Drive Reversal is a good way to reject them\nTODO\n\nMai\n\nIf Mai shoots an OD fan to get the overhead tick on you very close, instead of walking back and dealing with the mixup, you can block and walk forward instead\nIf you attempt to PP Mai’s fans and miss, it’s oftentimes still good to hold the parry if you’re worried about the overhead/low mix when she’s driving forward. If you’re worried about throws when she’s driving forward, release and throw tech instead.\nTODO\n\nManon\n\njHK is deep, focus on anti-air\nAfter normal throw, her drive rush cMK oki is real\ncMP (and other nornmals) xx Drive Rush into command grab\nSA3 is actual grab\nManon has no OD reversal\nTODO\n\nMarisa\n\nMarisa is very weak to anti-air. If you jump with a deep vertical button or an empty jump from far away such that her anti-air cHP will whiff, you can likely get your offense started. Some Marisas are keen on watching out for AA situations more, using air-to-air and other tools. Figure out if the Marisa you’re playing is one of those or not and at least force her to know that you might jump by testing it. So the following breakdowns are useful:\n\nIf Marisa isn’t able to stop your jumps, play around with ranges and entries to force her to stress about it.\nIf Marisa is watching for air-to-air, fake jumps by pumping crouch (and returning to neutral) at ideal jump ranges to make her think you’re about to jump.\n\n\nTODO: to parry or not to parry gladius\nTODO: dealing with Phalanx: watch backwalking, AA with special/OD, AA with long jab for hard knockdown and potentially follow-up\nTODO\n\nM. Bison\n\nTODO: misplaced scissor kicks\nTODO: stHP isn’t special cancellable (but is super cancellable)\nTODO: space traps with LPs\nTODO: oki drive rushes\nTODO\n\nRashid\n\nWhen you block Rashid’s stHP, it’s good to try to perfect parry the Tornado to stop him from setting up on you.\nDespite Rashid’s angles jumping from afar or over, he’s susceptible top anti-air.\nA lot of Rashid players have not trained crosscut, especially because his motion is a quarter-circle. Abuse cross-ups more.\nTODO\n\nRyu\n\nIf you walk and force him to whiff a Solar Plexus, punish with a long-ranged normal accordingly.\nIf you are trying to parry his Hadokens, hold down the parry in the case that he fakes it with a whiffed Hasogeki. If it’s whiffed, drive rush forward with a jab to interrupt him from throwing your parry.\nMisplaced LK or MK High Blade Kicks (aka Donkey Kicks) can be punished by long-ranged 11f (LK) and 8f (MK) moves on block. Figure out your character’s 8f longest-range button and use it if you know the spacing is wrong. (e.g. Ken can punish these on block with sMK,MK,HK).\nTODO: Ryu’s that Drive Rush cMK xx overhead/sMP/throw\nTODO\n\nSagat\n\nTODO: Tiger Nexus—if you’re betting on Greedy Tiger follow-up, duck and be prepared for cLP on whiff.\nTODO: Round Start tiger knee\nTODO: Sagat is really tall so unless someone is very focused on AA, there’s a high chance you get a block. Test it in awkward times (such as when Sagat is backwalking).\nTODO: Do not jab in-between Sagat’s sMP, otherwise he’ll tag you with a cMP combo. If you really want to steal between the sMPs, do so with a perfect parry or invincible reversal.\nTODO\n\nTerry\n\nTODO: Default Terry, running away and poking with c.MK.\nTODO: Shooting over Terry’s Fireball to trade\nTODO\n\nZangief\n\nTODO: Game with Zangief is to check him as often as\nTODO: Guesswork, watch to jump from far away due to running bear grab—are they a running bear grab player? Hops to low-crush and push advantage? Jumping? Walking?\nTODO: backwalking uppercuts\nTODO: Many Zangief players won’t expect you to walk forward + throw\nTODO\n"},"index":{"slug":"index","filePath":"index.md","title":"Huy's Fighting Game Obsidian Notes","links":[],"tags":[],"content":"Welcome to a dump of Huy’s Obsidian Notes for Fighting Games!"}}