{"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Delayed-Whiff-Punish-Option-Select":{"slug":"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Delayed-Whiff-Punish-Option-Select","filePath":"Street Fighter 6/General Training Drills/Advanced Drills/Delayed Whiff Punish Option Select.md","title":"Delayed Whiff Punish Option Select","links":[],"tags":[],"content":"Space trap/whiff punish drill\nUsefulness: high"},"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Reversal-Defense-Option-Select":{"slug":"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Reversal-Defense-Option-Select","filePath":"Street Fighter 6/General Training Drills/Advanced Drills/Drive Reversal Defense Option Select.md","title":"Drive Reversal Defense Option Select","links":[],"tags":[],"content":"Drive Reversal Defense Option Select. cr.LK xx SA1 after wake-up DR. If they block, SA1 doesn’t come out. aka Nephew tech aka what Micky did at EVO 2025\nUsefulness: low"},"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Rush-Defense-Option-Select":{"slug":"Street-Fighter-6/General-Training-Drills/Advanced-Drills/Drive-Rush-Defense-Option-Select","filePath":"Street Fighter 6/General Training Drills/Advanced Drills/Drive Rush Defense Option Select.md","title":"Drive Rush Defense Option Select","links":[],"tags":[],"content":"Usefulness: medium-low"},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Crosscut-Uppercuts":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Crosscut-Uppercuts","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Crosscut Uppercuts.md","title":"Crosscut Uppercuts","links":[],"tags":[],"content":""},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Delayed-Drive-Rush-Offense":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Delayed-Drive-Rush-Offense","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Delayed Drive Rush Offense.md","title":"Delayed Drive Rush Offense","links":[],"tags":[],"content":"Frame trap drill"},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Impact-Defense":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Impact-Defense","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Drive Impact Defense.md","title":"Drive Impact Defense","links":[],"tags":[],"content":""},"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Rush-Defense":{"slug":"Street-Fighter-6/General-Training-Drills/Basic-Drills/Drive-Rush-Defense","filePath":"Street Fighter 6/General Training Drills/Basic Drills/Drive Rush Defense.md","title":"Drive Rush Defense","links":[],"tags":[],"content":"TODO: Juri"},"Street-Fighter-6/General-Training-Drills/Introduction-and-Fundamentals":{"slug":"Street-Fighter-6/General-Training-Drills/Introduction-and-Fundamentals","filePath":"Street Fighter 6/General Training Drills/Introduction and Fundamentals.md","title":"Introduction and Fundamentals","links":["Street-Fighter-6/Goal-Setting"],"tags":[],"content":"TODO: Why training drills?\n\nrepeat situations and learn quickly, encode it\nlow-stress way to play, common in sports training\neasy way to\n\nDesigning offensive and defensive combination drills\ncorner carry\nmeterless\nfinishing combo\nHow to effectively record SF6 actions\nTODO: Menu on first input\nTODO: spacing based on training grid\nHow many reps and sets should you do\nThe science of encoding\nTODO: philosophy\nchatgpt.com/c/68ddba43-a15c-8326-a50b-42fc6a6ed1f8\nBruce Lee\nen.wikipedia.org/wiki/Motor_program\nsports: ibtihaj, steph curry,\nPhases of learning the skill\nTODO\nDrilling the skill to learn\nTODO\nTopping the skill off through repeating the drill lightly\nTODO\nHow many drills should you be juggling at any time and how much time should be devoted to drills\nTODO: my own\nSee Goal Setting.\nWhat about combo practice\nCombo practice is important in any fighting game. Where Street Fighter 6’s combo mastery lies though is knowing the situation\nThe essential combos:\n\nJab confirm combo. Whenever you get a jab, what is the meter-less follow-up?\nAll-resource combo. Whenever you can kill, do you know how to route to using all of your drive meter and Super Art 3 to finish someone off?\nDrive impact combo. Whenever you land a drive impact, do you know what combo to use before your opponent falls over?\nLong-ranged drive rush combo. When you’re battling in neutral and throwing out a medium or heavy button, do you have a combo that you can buffer Drive Rush behind and confirm?\nOki-setup combo. Do you have a combo where you trade damage to get another chance of keeping your turn and putting them into a mixup?\nCorner-carry combo. If you need to push your opponent into the corner, do you have a combo that pushes them further than others?\n\nAdvanced combos incorporate more factors such as mid-combo resets (usually into a Drive Rush overhead or corner Drive Impact), corner escape, using super arts 1 and 2, drive damage, whether you can kill, safe jump setups, corner-only damage optimizations, and more. As you play your character longer and the above standard combos get ingrained, you should keep branching out as a player.\nAsking yourself what is optimal for yourself and valuing the eventual matrix of the different factors between your combos is a part of your own play style and creative expression.\nWhat about frame traps and space traps\nTODO\nWhat should I train next\nTODO: framework on\n\nWhat are you getting hit by?\nDid you convert your hits optimally?\nWhat are you repeatedly doing that didn’t work?\n\nTODO: drive rushing and getting checked\nTODO: If you’re constantly walking back and your opponent never whiffs a button and keeps approaching, you should probably stop walking back\n\n\nWhat are buttons you aren’t hitting? What moves aren’t you using?\nAre you always low on resources most of the match?\nAre you still doing what your character should be good at? Are those strengths coming out against matchups?\n\nThis refinement of training strategy is what makes players different, so forge your own path."},"Street-Fighter-6/Goal-Setting":{"slug":"Street-Fighter-6/Goal-Setting","filePath":"Street Fighter 6/Goal Setting.md","title":"Goal Setting","links":[],"tags":[],"content":"What will it take (in general)\nBenchmarking from other players\nOne way to approach figuring out what\nWhat will it take (specifically) for me to hit my goals\nTODO: don’t know what it’ll be for you, but this is my working theory\nQuestions I want to answer\n\nWhat if I redistributed my hours\nWhat if I actually practiced\nEventually, can I do this with more characters more easily now that I’m at this new milestone?\n\nPacts to chunk learning\nHow I plan and track my learning\nTemplate\nExample"},"Street-Fighter-6/Huy's-Ken-Journey/Introduction-and-Goals":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Introduction-and-Goals","filePath":"Street Fighter 6/Huy's Ken Journey/Introduction and Goals.md","title":"Introduction and Goals","links":[],"tags":[],"content":"These are actual notes that I’ve collected and worked in my brain when playing Ken. No more, no less. These are here as a record of what it took me.\nThere are a few core things to note about my journey that is relevant:\n\nI have the pleasure of being surrounded by great players who helped me grow every Thursday. Without putting in those hours with them and having a shared love for this game, I wouldn’t have tried this. I’ve already learned how to play nuanced Street Fighter from playing with them on so many Thursdays.\nTODO: I’m over-indexed on BattleHub and Custom Room — so the next part of my journey is fixing Ranked Matches and using Training Mode explicitly // start hours\nFinding the time to play is difficult. I typically only play games for 3 hours a week, which was Thursday. I had to carve out an additional 7 hours (or 2 nights) a week for this strategy to work.\n\nTraining drills\nCombos\nTraining drills\nUnsorted\nGoals:\n\nPut 1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000 matches (50 hours each) into Ranked Matches! Buy 2 Outfits at each milestone.\nHit 1600MR (High), 1650MR, 1700MR (Grand), 1750MR, 1800MR (Ultimate). Buy 2 Outfits, C1 Color Bundle, 1 Challenger Avatar at each milestone.\n\nOutstanding Purchases: 2 Outfits, 1 Color Bundles.\n*1000 Ranked Matches = 50 hours.\n*For Buy C1 Color Bundle, alternatively buy 8 colors."},"Street-Fighter-6/Huy's-Ken-Journey/Ken-Drive-Damage-Routes":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Ken-Drive-Damage-Routes","filePath":"Street Fighter 6/Huy's Ken Journey/Ken Drive Damage Routes.md","title":"Ken Drive Damage Routes","links":[],"tags":[],"content":"Drive Damage Tests\n\n(fully blocked) (Drive Rush cMP OR sHP) xx Drive Rush sHP xx MK Jinrai Kick, LK follow-up. True block-string other than the LK follow-up, use 3 bars of drive for 1.5 bars of drive damage. If you can get sHP by itself without cancel or sHP xx HK Jinrai before starting this, the drive damage will be immense.\nIn combo-routing, the only things that allow you to to go into a guaranteed Drive Impact on hit with Ken are heavy punches. So sHP xx Drive Impact or cHP xx Drive Impact will cost 1 drive bar to do 1 drive bar of damage. If you’re ahead on drive or they only have 1 drive bar left, this is something to be extremely aware of so that you don’t have to use Super Art meter. Remember that SA1 is 0.5 drive bars of damage, SA2 is 1 drive bar of damage, and SA3 is 1.5 drive bars of damage.\n\nKen’s SA2 on -5 on block or -1 on burnout\n\nYou can attack drive bar with a lot of resources: Drive Rush st.HP &gt; st.MP,HP xx Drive Rush st.HP &gt; st.MP,HP xx OD Jinrai,HK,HK xx SA2 for 3.8 drive bars of drive damage costing 5.1 drive bars. If they push a button during st.MP,HP xx Drive Rush st.HP, you will trade and you can score a hit of st.HP xx whatever (like running into run DP).\nDrive Rush st.HP &gt; st.MP,HP xx OD Jinrai,HK,HK xx SA2 costs 2.8 drive bars to do 2.9 drive bars of drive damage.\nMax chip damage in corner when they’re burnt out: st.MP xx OD Hadoken &gt; st.MP xx OD Hadoken &gt; st.LK xx OD Jinrai,HK,HK xx SA2 &gt; OD Shoryuken\n"},"Street-Fighter-6/Huy's-Ken-Journey/Ken-Okizeme-Notes":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Ken-Okizeme-Notes","filePath":"Street Fighter 6/Huy's Ken Journey/Ken Okizeme Notes.md","title":"Ken Okizeme Notes","links":[],"tags":[],"content":"Okizeme Situations\n25f routing\n\nsMP, HP xx run, run Shoryuken = 25f oki\nHP Shoryuken = 25f oki\nOkizeme\n(whiff) c.LP &gt; (usually blocked) s.HP &gt; s.LP (invest more with xx Drive Rush s.LP)\n\n26f routing\n\nsMP, HP xx MK Jinrai &gt; HP Shoryuken = 26f oki\nsMP, HP xx MK Jinrai, delayed HK follow-up &gt; HP Shoryuken = 26f-27f\nOkizeme\n(see 25f routing)\n\n28f routing\n\nJinrai LK and MK &gt; CH follow-up LK = 28f oki\nTODO: Okizeme\nTODO: (whiff) s.MP &gt; c.MP xx MK Jinrai, LK follow-up?\nforward dash &gt; st.HP\nrun &gt; run overhead kick\nforward dash &gt; forward throw (might need microwalk if they backroll)\nforward dash &gt; microwalk back to avoid the throw for possible shimmy setup\n(corner) (whiff) st.LP &gt; OD Hadoken is +2 on block, +6 on regular hit. It will also beat level 1 supers on OD Hadoken, so you can keep continuing with cr.HP when you Punish Counter them.\n(corner) (whiff) cr.LK &gt; st.HP is 0 on block, +5 on regular hit\n\n32f routing\n\nsMK, MK, HK\nTODO: Okizeme\n\n33f/34f routing\nShould I discard this route? I’m used to using it, but it does do less damage than the HP Shoryuken variants in the corner. It’s good for creating baits though, so when you land, you can bait a whiffed s.MP and then walk back with more frames.\n\nc.MP xx LK Tatsumaki &gt; MP Shoryuken = 33f\nsMP, HP xx MK Jinrai, delayed HK follow-up &gt; MP Shoryuken = 33f-34f\nsMP, HP xx MK Jinrai &gt; MP Shoryuken = 34f\nTODO: Okizeme\n\n36f routing\n\nSuper Art 2 = 36f oki\nOkizeme\n(corner) (whiff) s.LP &gt; LP Hadouken? TODO: Test\n\n40f routing\n\nc.HK\nOkizeme\nTODO\n\n42f routing\nThis is the corner safe jump route.\n\nsMP, HP xx MK Jinrai = 42f oki.\ns.MP, HP xx run, run Dragonlash = 42f oki.\nOkizeme\n(corner) safe j.HP for major advantage on block, TODO: test shimmy ability\n(corner) safe j.MK for minor advantage on block, but easier throw timing. TODO: test shimmy ability\n(corner) safe empty jump for low/throw mixup\n(corner) (whiff) s.MK &gt; s.HP\nTODO: (corner) safe j.LK? , TODO: test shimmy ability\nTODO: (corner) safe j.HK, TODO: test shimmy ability\ntwo dashes &gt; throw\ntwo dashes &gt; c.LP\n\n43f routing\n\ns.MP, HP xx run, run Tatsumaki = 43f oki\nOkizeme\n(corner) Whiffed empty jump, you won’t get a normal with it on block. So it’s best to go for throw, s.LP, or c.LK.\n(whiff) s.LP xx run, run overhead &gt; c.LP &gt; s.MP, HP xx MK Jinrai, HK followup &gt; HP Shoryuken\n(whiff) s.LP xx run, run stop &gt; c.LK, s.LP, s.LP xx HP Shoryuken\n(whiff) s.LP xx run, run stop &gt; throw\n\nTODO: c.HP xx HK Hurricane Kick\nTODO: c.MK xx MK Hurricane Kick\nOkizeme Building Blocks\nThese moves should help construct new okizeme situations. Remember that if you can get the block situation such that it’s +f because you’re on the last active frame, that’s a winner. Otherwise, you want to be able to mix between multiple options.\nMoves\n\nDash forward. 19f total.\nDash backward. 22f total.\nThrow: i5f/30f total.\nrun, run stop. 16f total.\nrun, run overhead. i18f/40f total/-3f on block.\nrun, run step kick. i10f/33f total/-4 on block.\ncLP = i4f/14f\ntotal/-1f on block.\nsLP = i4f/13f total/-1f on block.\ncMP. i6f/24f total/0f on block.\nsMP. i5f/22f total/-2f on block.\ncHP = i8f/35f total/-10f on block.\nsHP = i10f/31f total/-2f on block.\ncLK = i5f/18f total/-3f on block.\nsLK = i5f/18f total/-2f on block.\ncMK = i7f /28f total/-6f on block.\nsMK = i8f/30f total/-5f on block.\ncHK = i8f/35f total/-10f on block.\nsHK = i12f/38f total/-5f on block.\n"},"Street-Fighter-6/Huy's-Ken-Journey/Ken-Player-Checks":{"slug":"Street-Fighter-6/Huy's-Ken-Journey/Ken-Player-Checks","filePath":"Street Fighter 6/Huy's Ken Journey/Ken Player Checks.md","title":"Ken Player Checks","links":[],"tags":[],"content":"TODO: cMK xx Drive Rush sLP &gt; throw vs. sMP\nTODO: oki drive rush cLK (walking away, throw tech, or cLP) vs drive rush cMP/sHP\nTODO: sLK &gt; sHK will they eat space traps?\nTODO: Jinrai: do they jab under pressure?\nTODO: Range 2.5 LP Hadoken: will they jump improperly?\nTODO: will they react to DI?\nTODO: will they reverse/PP/etc. the Jinrai follow-up?\nTODO: will they check drive rushes at neutral?\nTODO: Are they parrying too much?\nTODO: are they walking back too much?\nTODO: are they shimmying too much?"},"Street-Fighter-6/Ranked-Matches/Introduction-and-Fundamentals":{"slug":"Street-Fighter-6/Ranked-Matches/Introduction-and-Fundamentals","filePath":"Street Fighter 6/Ranked Matches/Introduction and Fundamentals.md","title":"Introduction and Fundamentals","links":["Street-Fighter-6/Goal-Setting","Street-Fighter-6/General-Training-Drills/Basic-Drills/Delayed-Drive-Rush-Offense","Street-Fighter-6/General-Training-Drills/Advanced-Drills/Delayed-Whiff-Punish-Option-Select"],"tags":[],"content":"Having a game plan for matchups\nThere is a clear difference between a player that heads into a matchup thinking about what plan they’re going to execute and one that doesn’t have one at all. So how should you approach it?\nThese are the things I’m working with:\n\nRecount anti-character matchup notes in my head when I see the character appear on the challenger screen.\nHave a set of questions that I want to answer for my own character (or in general) before I start. Specific ones to such as what the enemy will wakeup with after Ken’s corner carry to what will an opponent do when I execute a Jinrai on block. General ones such as will they let me jump in on them. Will they throw tech proactively?\nHave a set of questions that I want to answer from my opponent’s character. Are they this type of player who does this with their character? What will they abuse? What will they put on the table.\n\nWith this simple framework, we can create the intention to approach every match with a plan, but still keep out too much bias.\nManaging momentum and energy\nSee Goal Setting.\nReducing rank importance of opponents and managing long sessions\nWe all intrinsically know that points don’t matter. Whether they’re League Points (LP) or Master Rate (MR), it’s just a number that goes up and down. However, we’ve all been trained by society to do well in school and compete. That’s healthy in many ways and unhealthy in others.\nIf we look at the best players in Benchmarking from other players, we understand that it takes many battles and hours to get there. And realistically, we wouldn’t have it many other way because if it was any other way, we would also know there’s a ceiling that is capped solely by “innate talent” versus dedication and hard work. So the answer to getting better is to play, even if playing isn’t easy.\nFor me, the tactics that have actually worked making playing ranked easier:\n\nUse Street Fighter 6’s HUD to hide displaying ranks. Underestimating or overestimating your opponents is one of the deadliest things that can affect your play. When you play in-person, there is no magical rank that floats over their heads, so just remove it. Everyone you play deserves the same level of respect.\nRemember that your own rank and number is only where it’s at if you stop playing. There is no such thing as actual failure. And its’ value is only what you give it, so celebrate the victories and forgive yourself when you’re down. Growth takes adversity and this is what hard looks like. If it wasn’t hard, it wouldn’t be worth the effort.\nCount the number of battles you’ve played in the current session rather than wins/losses. Set goals to hit a battle count rather than to keep playing until you’re up (or recovering from being down) on points. I keep a stack of poker chips that I move from one stack to the next, converting 1s to 5s and 25s. The act of just counting and seeing a number go up rewires the monkey brain from caring too much about the in-game numbers. It’s healthy to set a goal before the session so that you know when you’re stopping. If you hit your goal, you can decide to go for another limited amount of battles or just switch to practice/training.\n\nNeutral skips\nAll fighting games are built around some sort of neutral skipping, character-specific movement, and ranges. That is a fact of character differences to core game mechanics. How you deal with them\nAt the beginning, learning how to neutral skip will enable you many victories. Similarly, using all of your resources will secure you many victories. But as you get better, you learn nuance to when you should use resources and when you should use neutral skips.\nOnce you’re in Master, you’ll feel these even more:\n\nBurning out early is deadly at Master and can lead to immediate checkmating.\nDrive Rush is a lot less powerful than before, with many able to check you.\nAny “stops” sends a dramatic message.\n\nThis means that the value of meter-less combos, character positioning, and anti-airs become even more important.\nThe goal then is to solidify using them and introducing more variation and taking less risks. For example, simply moving quickly left/right with your character repeatedly can trigger people awaiting dashes and Drive Rushes, giving you an opportunity to mask your movement. So use the understanding of the Green, Yellow, and Red Zones and human reactions appropriately.\nVisualization and categorizing opponent through jargon\nOne of the things we all do as players is to categorize opponents when we face them in a set. We all do this subconsciously. However, if we do this consciously, it opens up solutions that we wouldn’t normally take, allowing us to exceed the expectations of the opponent and ourselves.\nI recategorize players every new set with the following jargon:\n\nWhen playing the footsies triangle: approach, protect, sway.\n\nApproach. Walking forward to close space and potentially make a move.\nProtect. Putting a move to stop someone from walking forward, usually at max confident range.\nSway. Walking backward to create space for a whiffed move and then punishing it. Note that the #1 reason many players who walk backward lose is that they don’t look for a whiff and get cornered for giving away the space for free. That’s why the word here is “sway.”\n\n\nWhen playing defense: block, parry, reverse.\n\nBlock.\nParry.\nReverse.\n\n\nWhen playing timing: immediate, slightly/counter-hitting (aka. counter: slightly delayed, looking for interrupt), heavy/whiff-punishing (aka: reposte: heavily delayed, looking for whiff).\n\nImmediate.\nSlight/Counter-Hitting.\n\nA drill useful for training delayed buttons is using the Delayed Drive Rush Offense because you’re in an advantaged situation.\n\n\nHeavy/Whiff-Punishing.\n\nA drill useful for training whiff punishing at the expert level is Delayed Whiff Punish Option Select because you’re able to fish out medium normals and spacing.\n\n\n\n\n"},"Street-Fighter-6/Ranked-Matches/Matchups":{"slug":"Street-Fighter-6/Ranked-Matches/Matchups","filePath":"Street Fighter 6/Ranked Matches/Matchups.md","title":"Matchups","links":[],"tags":[],"content":"\nAKI\n\nTODO: AKI has no OD reversal\nTODO\n\n\nAkuma\n\nTODO\n\n\nBison\n\nTODO: misplaced scissor kicks\nTODO: stHP isn’t special cancellable (but is super cancellable)\nTODO: space traps with LPs\nTODO: oki drive rushes\nTODO\n\n\nBlanka\n\nTODO: air ball\nTODO: DP pockets, use LP DP\nTODO: It’s very difficult to PP Blanka Ball or DP it, it isn’t Headbutt, proceed with caution. If you do try to PP a Blanka Ball, it’s worth holding onto parry and drive rushing after to see if you can get anything\nTODO: If you can shoot, shooting once or twice can get the Blanka thinking about  sliding. Keep putting in thoughts of what you might do to force unwanted moves.\nTODO\n\n\nCammy\n\nAt Range 2.5+, if Cammy is going to travel across the screen, it’s going to be Spin Knuckle or Hooligan Combination. Both can be beaten by jabs, conversion is different though.\nCammy players are good at figuring out when to Cannon Strike, usually when you’re walking back. TODO backwalking uppercuts\nTODO\n\n\nChun-Li\n\nChun’s jump time from normal jumps and how the screen shifts vertically when she goes up provides a good tell for anti-airs. If she crosses you up with her df+HK (Falling Crane), crosscut it.\nChun’s light fireball goes about 2 character ranges away before it disappates. A good way to fight her is to backdash/walk back into the disappate range and then prepare to check her if she walks in thinking she still has the shield to block you.\nTODO\n\n\nC. Viper\n\nTODO\n\n\nDee Jay\n\nTODO: overhead tests\nTODO: drive rush checks with OD, especially when low on meter\nTODO: long-ranged DI\nTODO\n\n\nDhalsim\n\nTODO: Ground and air teleport\nTODO\n\n\nE. Honda\n\nTODO: Understanding charge timing\nTODO: Will he do OD Headbutt after Headbutt\nTODO: Round opener buttslam\nTODO: OD reversal?\nTODO\n\n\nEd\n\nTODO: Ed’s range and checking (see Jamie notes). High confidence.\nTODO: whiffed uppercuts\nTODO: safe jumps\nTODO: DIs\nTODO: backing away and making him come to you\nTODO\n\n\nElena\n\nTODO: You can’t whiff heavy attacks against Elena and likely not even medium attacks in neutral\nTODO\n\n\nGuile\n\nTODO: overhead tests\nTODO: Sonic blade low vulnerability\nTODO\n\n\nJamie\n\nJamie’s space traps are built in, don’t push buttons after most moves—it’s a setup. Because of Jamie’s confidence in space traps and pushing buttons, checks can come easily too. Do not drive rush to try to cheat neutral.\nJamie can setup a safe-jump when cornering you off of most conversions. Fuzzy block into throw\nTODO\n\n\nJP\n\nTODO: whiffed cHP\nTODO: Fighting under departures\nTODO\n\n\nJuri\n\nTODO: Slowing down Juri’s dashes midscreen.\nTODO: Midscreen DR throw loop. Corner throw loop.\nTODO\n\n\nKen\n\nTODO: Ken has no +on block normals outside of drive rush.\nTODO: HK Dragonlash\nTODO\n\n\nKimberly\n\nTODO: An opener a lot of Kimberlys like to take is jumping into a whiffed elbow to bait a DP reaction and then go for the punish. If you’re ready for this, you can drive rush up into your own push or even anti-air.\nTODO: always be ready to DI on a corner reset\nTODO\n\n\nLily\n\nLily needs stock and her ability to check you might be\nLily will test whether you DI after blocking a cHP. You can tell if she does whether she does cHP xx Wind Stock automatically or if she does cHP with no follow-up. If you’re going to try TODO\nTODO\n\n\nLuke\n\nLukes like to cMP/cMK drive rush into pressure, so Drive Rush Defense Option Select Or Drive Reversal is a good way to reject them\nTODO\n\n\nMai\n\nIf Mai shoots an OD fan to get the overhead tick on you very close, instead of walking back and dealing with the mixup, you can block and walk forward instead\nIf you attempt to PP Mai’s fans and miss, it’s oftentimes still good to hold the parry if you’re worried about the overhead/low mix when she’s driving forward. If you’re worried about throws when she’s driving forward, release and throw tech instead.\nTODO\n\n\nManon TODO\n\njHK is deep, focus on anti-air\nAfter normal throw, her drive rush cMK oki is real\ncMP (and other nornmals) xx Drive Rush into command grab\nSA3 is actual grab\nManon has no OD reversal\nTODO\n\n\nMarisa\n\nMarisa is very weak to anti-air. If you jump with a deep vertical button or an empty jump from far away such that her anti-air cHP will whiff, you can likely get your offense started. Some Marisas are keen on watching out for AA situations more, using air-to-air and other tools. Figure out if the Marisa you’re playing is one of those or not and at least force her to know that you might jump by testing it.\nTODO\n\n\nRashid\n\nWhen you block Rashid’s stHP, it’s good to try to perfect parry the Tornado to stop him from setting up on you.\nDespite Rashid’s angles jumping from afar or over, he’s susceptible top anti-air.\nA lot of Rashid players have not trained crosscut, especially because his motion is a quarter-circle. Abuse cross-ups more.\nTODO\n\n\nRyu\n\nIf you walk and force him to whiff a Solar Plexus, punish with a long-ranged normal accordingly.\nIf you are trying to parry his Hadokens, hold down the parry in the case that he fakes it with a whiffed Hasogeki. If it’s whiffed, drive rush forward with a jab to interrupt him from throwing your parry.\nMisplaced LK or MK High Blade Kicks (aka Donkey Kicks) can be punished by long-ranged 11f (LK) and 8f (MK) moves on block. Figure out your character’s 8f longest-range button and use it if you know the spacing is wrong. (e.g. Ken can punish these on block with sMK,MK,HK).\nTODO: Ryu’s that Drive Rush cMK xx overhead/sMP/throw\nTODO\n\n\nSagat\n\nTODO: Tiger Nexus\nTODO: Round Start tiger knee\nTODO: Sagat is really tall so unless someone is very focused on AA, there’s a high chance you get a block. Test it in awkward times (such as when Sagat is backwalking).\nTODO\n\n\nTerry\n\nTODO: Default Terry, running away and poking with c.MK.\nTODO: Shooting over Terry’s Fireball to trade\nTODO\n\n\nZangief\n\nTODO: Game with Zangief is to check him as often as\nTODO: Guesswork, watch to jump from far away due to running bear grab—are they a running bear grab player? Hops to low-crush and push advantage? Jumping? Walking?\nTODO: backwalking uppercuts\nTODO: Many Zangief players won’t expect you to walk forward + throw\nTODO\n\n\n"},"index":{"slug":"index","filePath":"index.md","title":"Welcome to Quartz","links":[],"tags":[],"content":"This is a blank Quartz installation.\nSee the documentation for how to get started."}}